/********************************************************************************
* @author: Li jiaqi
* @email: 547222867@qq.com
* @date: 2022/8/26 23:57
* @version: 1.0
* @description:
********************************************************************************/

#ifndef LEETCODE_NO_62_H
#define LEETCODE_NO_62_H
/*
 * 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。
 * 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。
 * 问总共有多少条不同的路径？
 *
 */
int uniquePaths(int m, int n);
#endif //LEETCODE_NO_62_H
